{
  "id": "page:MENTORSHIP_OVERVIEW",
  "page": {
    "title": "Mentorship Programme",
    "description": "Mentorship is a fantastic way to get support for your personal growth and career development. Mentorship relationships can be rewarding to both people, personally and professionally. It's an opportunity to develop communication skills, expand your viewpoints, and consider new ways of approaching situations. And both partners can advance their careers in the process."
  },
  "mentorSection": {
    "title": "Become a Mentor",
    "description": "You should apply to be a mentor if you:",
    "topics": [
      "Want to extend your professional network",
      "Want to contribute to the community",
      "You are ready to share expertise",
      "You want to get a new perspective and learn from your mentees"
    ],
    "link": {
      "label": "Join as a mentor",
      "uri": "/mentorship/mentor-registration"
    }
  },
  "menteeSection": {
    "title": "Become a Mentee",
    "description": "You should apply to be a mentee if you:",
    "topics": [
      "Want to start career in software engineering",
      "Want to find a better job",
      "Want to be promoted at work",
      "Want to apply for a leadership position",
      "Need support in advancing your career"
    ],
    "link": {
      "label": "Check our mentors",
      "uri": "/mentorship/mentors"
    }
  },
  "feedbackSection": {
    "title": "What do participants think about our Mentorship Programme?",
    "feedbacks": [
      {
        "name": "Lucy",
        "feedback": "It is great to be able to share my experience as a newbie in Tech with someone that has more years and experience in the industry. It has definitely made me feel more comfortable with been a completely beginner again and confident that, if a put the hours in, one day it will be pay off.",
        "mentee": true,
        "year": "2024"
      },
      {
        "name": "Ana Smith",
        "feedback": "I am exciting with this mentorship program. This is really help me to pursue my goals. I got encouragement, insights, knowledge from my mentor that makes me back on the track and focus to what I have now, upgrade it, then reach out my goals.",
        "mentee": true,
        "year": "2023"
      },
      {
        "name": "Jane",
        "feedback": "My mentor has done an excellent job accommodating me and guiding me this year. This was my first experience as a mentee and it has taken time getting my footing. I entered this program because I felt isolated since I seemed to not have any clarity of my career and had a sense of general \"directionless\". Mentor has made me feel validated in my feeling and has helped me understand that my anxiety stems from not having a good understanding of the industry I hope to be a part of. Through our sessions and an exercise she gave me, I was gained a better perceptive on how exactly to direct my focus.",
        "mentee": false,
        "year": "2022"
      },
      {
        "name": "Anonymous",
        "feedback": "It is an extremely helpful program and the mentor is quite open with matching my needs. She also actively encourages me with when and how to make job applications. She has helped with reviewing my CV and Linkedin profile. We have started work on my own personal project and collaboratively code on it, with the mentor asking questions to reinforce learning.",
        "mentee": true,
        "year": "2022"
      }
    ]
  }
}