{
  "id": "page:PARTNERS",
  "heroSection": {
    "title": "WCC Partners",
    "customStyle": {
      "backgroundColour": {
        "color": "primary",
        "shade": {
          "name": "light",
          "value": 90
        }
      }
    }
  },
  "introSection": {
    "title": "Why partner with us?",
    "items": [
      "Align with our mission to break barriers and advocate for gender equality in tech.",
      "Engage in sponsorships, event collaborations, mentorship programs, and other programs.",
      "Connect with and mentor talented women in tech.",
      "Support initiatives that advocate for women’s rights, education, and professional development in technology."
    ]
  },
  "contact": {
    "title": "Become a WCC Partner",
    "links": [
      {
        "type": "email",
        "link": "london@womencodingcommunity.com"
      },
      {
        "type": "slack",
        "link": "https://join.slack.com/t/womencodingcommunity/shared_invite/zt-2hpjwpx7l-rgceYBIWp6pCiwc0hVsX8A"
      }
    ]
  },
  "partners": {
    "title": "Meet Our Partners",
    "description": "Our partners are committed to supporting our mission and empowering",
    "items": [
      {
        "image": {
          "path": "https://drive.google.com/uc?id=1sxYKgOSzql2sFX9FLnEHAQhmskOHwBzI&export=download",
          "alt": "SurrealDB logo",
          "type": "desktop"
        },
        "name": "SurrealDB",
        "description": "SurrealDB is an innovative, multi-model, cloud-ready database, suitable for modern and traditional applications. Its versatility, and focus on developer experience, along with the ability for deployment on cloud, on-premise, embedded, and in edge computing environments, allows developers and organizations to meet the needs of their applications, without needing to worry about scalability or keeping data consistent across multiple different database platforms.\n\nSurrealDB have also established the Women in Rust community, a meetup group where women can connect, collaborate, and grow their skills in Rust.",
        "link": {
          "label": "Visit SurrealDB",
          "uri": "https://surrealdb.com/"
        }
      },
      {
        "image": {
          "path": "https://drive.google.com/uc?id=1aR_a7gAA31YdlEST9gGgT9J8t1DHZr_y&export=download",
          "alt": "Amazon logo",
          "type": "desktop"
        },
        "name": "Amazon",
        "description": "Amazon is a global leader in e-commerce, redefining online shopping with its vast product selection, seamless customer experience, and advanced logistics network. With innovations like Amazon Prime, one-click purchasing, and a commitment to fast and reliable delivery, Amazon has transformed the way people shop worldwide.\n\nBeyond e-commerce, Amazon supports education and career growth through initiatives like Amazon Future Engineer, which provides opportunities for underrepresented groups in technology.",
        "link": {
          "label": "Visit Amazon",
          "uri": "https://www.amazon.com/"
        }
      },
      {
        "image": {
          "path": "https://drive.google.com/uc?id=1t6N6QEB3KQVZLLlrk3G6MOalAfxIwk-8&export=download",
          "alt": "JetBrains logo",
          "type": "desktop"
        },
        "name": "JetBrains",
        "description": "JetBrains creates intelligent software development tools used by over 11.4 million professionals and 88 Fortune Global Top 100 companies. Its lineup of more than 30 products includes IDEs for most programming languages and technologies, such as IntelliJ IDEA, PyCharm, and others, as well as products for team collaboration, like YouTrack and TeamCity.\n\nJetBrains is also known for creating the Kotlin programming language, a cross-platform language used by more than 5 million developers worldwide yearly and recommended by Google as the preferred language for Android development.",
        "link": {
          "label": "Visit JetBrains",
          "uri": "https://www.jetbrains.com/"
        }
      },
      {
        "image": {
          "path": "https://drive.google.com/uc?id=1YO0SUlMEvYsP0AdgVWT6X3HR1Lq5x6bZ&export=download",
          "alt": "Devoxx UK logo",
          "type": "desktop"
        },
        "name": "Devoxx UK",
        "description": "Provide a first class tech conference where passionate developers can network, hack, get inspired and learn throughout. \n\nDevoxx is a conference by developers, for developers. It is offered at an affordable price so that every developer can enjoy the experience. \n\nDevoxx UK is a community effort. The team is made up of senior developers, user group leaders and passionate experts",
        "link": {
          "label": "Visit Devoxx UK",
          "uri": "https://www.devoxx.co.uk/"
        }
      },
      {
        "image": {
          "path": "https://drive.google.com/uc?id=1tNYfg0f5Hv78q89Q8tD15tmWyFNQ7fUZ&export=download",
          "alt": "WomenTech Network logo",
          "type": "desktop"
        },
        "name": "WomenTech Network",
        "description": "WomenTech Network is one of the world's leading communities for women in tech with more than 9,000 Global Ambassadors representing 179 countries. \n\n70,000 tech leaders have collaborated with the network to date in order to cultivate a diverse global network that reaches 4.5 million people. WomenTech Network strives to empower women in tech through leadership development, professional growth, and mentorship programs. WomenTech Network hosts regular career networking events and a global tech conference for members to connect with like-minded professionals and learn about job opportunities at leading companies that value diversity.\n\nWomenTech Network’s mission is to empower women in tech through leadership development, professional growth, mentorship, and networking events. WomenTech Network is inspiring women to make a difference by building impactful and inclusive technology while introducing them to like-minded people, inspiring speakers, and opportunities at leading companies that aim to create diverse teams and a culture of belonging.",
        "link": {
          "label": "Visit WomenTech Network",
          "uri": "https://www.womentech.net/"
        }
      }
    ]
  }
}
